;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! groovy-mode)
(package! org-jira)
(package! org-drill)
(package! restclient)
(package! lsp-python-ms)
(package! python-black)
(package! alert)
(package! esup)
(package! wakatime-mode)
(package! gruvbox-theme)
(package! modus-operandi-theme)
(package! lsp-treemacs)
(package! anki-editor)

(package! example
  :recipe (:host github :repo "veelenga/carbon-now-sh.el"))
;;(package! org-protocol)
